function AboutMe() {
    return (
        <div className="info-container">
            <div className="section">
                <h2>קצת עליי</h2>
                <p>
                    היי! אני אביטל – מפתחת תוכנה עם אהבה אמיתית ליצירת פתרונות דיגיטליים שיש להם ערך.<br/>
                     האתר הזה הוא לא סתם פרויקט – הוא נולד מתוך רצון לבנות משהו שהוא באמת שימושי, נגיש וידידותי לכל אחת ואחת.
                </p>
            </div>

            <div className="section">
                <h2>מה הופך את האתר הזה למיוחד?</h2>
                <p>
                    הוא לגמרי שלכן!<br/>
                    אתן מוסיפות את השמלות הכי יפות שלכן, ומצד שני – גם יכולות למצוא כאן את השמלה המושלמת לאירוע הבא שלכן. <br/>
                    ואם משהו גורם ללב שלכן לדלג פעימה? פשוט תשלחו לי הודעה – ואני אעביר לכן את כל הפרטים. המטרה ברורה: שתהיו הכי מהממות,<br/>
                    בלי כאבי ראש! ✨
                </p>
            </div>

            <div className="section">
                <h2>הצצה מאחורי הקלעים – איך זה עובד?</h2>
                <ul>
                    <li>React עם Hooks – ליצירת חוויית משתמש חלקה</li>
                    <li>Node.js + Express – לבניית שרת חזק ו-REST API מסודר.</li>
                    <li>MongoDB – לניהול גמיש של כל הדאטה על השמלות באתר.</li>
                    <li>Axios – לתקשורת חלקה בין ה-Frontend ל-Backend.</li>
                    <li>CSS – לעיצוב רספונסיבי שמתאים לכל מסך ודפדפן.</li>
                    <li>JWT – לאבטחת הרשאות וגישה מאובטחת של המנהלת.</li>
                    <li>Nodemailer – לשליחת מיילים אוטומטית.</li>
                    <li>Render + Vercel – לפריסה בענן עם גישה נוחה ומהירה מכל מקום.</li>
                </ul>
            </div>

            <div className="section">
                <p>
                    אני מתרגשת לראות את הקהילה סביב האתר הולכת וגדלה – בזכותכן!<br/> מקווה שהוא יעזור לכן להגיע מוכנות ומלאות סטייל לכל אירוע קרוב.<br/> שניפגש רק בשמחות 💖
                </p>
            </div>

            <div className="section">
                <h2>ואם את כבר פה… 😉</h2>
                <h0><p>
                    מעבר לאהבה לעולם השמלות – אני גם מפתחת תוכנה שמחפשת את האתגר הבא שלה.<br/> אם את מכירה מישהי/מישהו שמחפשים מפתחת רצינית,  ועם ברק בעיניים – אני כאן 🙋🏻‍♀️<br/>
                    מוזמנת לבקר בפרופיל ה<a href="https://www.linkedin.com/in/avital-steinmetz/">לינקדאין שלי</a> ולהעביר הלאה.<br/>
                </p>
                <p>
                    או לשלוח לי מייל <a href="mailto:avitalsty@gmail.com">avitalsty@gmail.com</a>
                </p></h0>
            </div>
        </div>
    );
}

export default AboutMe;